//111111111111111111111111111111111111111111111111111111111111111111111111
//格式测试:
//邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵邵
//起始日期:
//完成日期:
//************************************************************************
//修改日志:
//	2019-05-13: 新增'tty 文本标准格式'风格
//, , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , , ,, , ,



//编译:
//g++ -o x ./old_normal_file_binary.cpp -g3



//关于'通用io'的二进制读写:
/*
	'通用io'对二进制文件的读写有一定优势, 一来你既然是二进制数据,
	没准数据容量会比较大, 如果携带缓冲区, 也不是不好, 但是意义不大.
	而来, 既然是二进制数据, 多数情况下, 读写的次数不会很多,
	都是一次两次读取, 装载一些'块数据',
	如果长时间频繁读取'块数据', 建议用FILE.
	如果只是简单读取一两次, 可以用'通用io'.
*/
